app/controllers/api/v1/denuncias_controller.rb

  def index
    @denuncias = Denuncia.page(current_page).per(per_page)
---
SELECT COUNT(*) FROM "denuncia"
SELECT "denuncia".* FROM "denuncia"

  def create
    @denuncia = current_api_user.denuncias.new(denuncia_params)
    @denuncia.status = "Pendente"
    if @denuncia.save
---
INSERT INTO "denuncia" ("descricao", "status", "latitude", "longitude", "usuario_criador", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @denuncia.update(denuncia_params)
      if @denuncia.medida != ""
        @denuncia.status = 'Concluida'
        @denuncia.save
---
UPDATE "denuncia" SET "descricao" = $1, "medida" = $2, "updated_at" = $3 WHERE "denuncia"."id" = $4  [["descricao", "Roubo a mão armada"], ["medida", ""], ["updated_at", "2021-05-08 19:15:41.595845"], ["id", 18]]
UPDATE "denuncia" SET "status" = $1, "updated_at" = $2 WHERE "denuncia"."id" = $3  [["status", "Concluida"], ["updated_at", "2021-05-08 19:38:14.643295"], ["id", 33]]

  def destroy
    @denuncia.destroy
---
DELETE FROM "denuncia" WHERE "denuncia"."id" = $1  [["id", 3]]

    def set_denuncia
      @denuncia = current_api_user.denuncias.find(params[:id])
---
SELECT "denuncia".* FROM "denuncia" WHERE "denuncia"."user_id" = $1 AND "denuncia"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 33], ["LIMIT", 1]]