app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "darlan@email.com"], ["LIMIT", 1]]
UPDATE "users" SET "sign_in_count" = $1, "current_sign_in_at" = $2, "last_sign_in_at" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["sign_in_count", 13], ["current_sign_in_at", "2021-05-14 02:22:15.533335"], ["last_sign_in_at", "2021-05-14 02:08:49.055816"], ["updated_at", "2021-05-14 02:22:15.534216"], ["id", 8]]
---
    def create
        user = User.find_by(email: sessions_params[:email])

        if user&.valid_password?(sessions_params[:password])
            sign_in user, store: false
            user.set_uid!
            user.save