app/controllers/denuncia_controller.rb

SELECT "denuncia".* FROM "denuncia"
---
  def index
    @denuncia = Denuncia.all